concurrency-test.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: concurrency-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 40s max duration (incl. graceful stop):
              * default: 50 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 46 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  00.9s/10s

running (02.0s), 50/50 VUs, 89 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  01.9s/10s

running (03.0s), 50/50 VUs, 147 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  02.9s/10s

running (04.0s), 50/50 VUs, 194 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  03.9s/10s

running (05.0s), 50/50 VUs, 259 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  04.9s/10s

running (06.0s), 50/50 VUs, 307 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  05.9s/10s

running (07.0s), 50/50 VUs, 354 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  06.9s/10s

running (08.0s), 50/50 VUs, 412 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  07.9s/10s

running (09.0s), 50/50 VUs, 473 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  08.9s/10s

running (10.0s), 50/50 VUs, 523 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  09.9s/10s

running (11.0s), 01/50 VUs, 576 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  10s


  █ THRESHOLDS 

    http_req_failed
    ✗ 'rate<0.01' rate=99.82%


  █ TOTAL RESULTS 

    checks_total.......: 577     52.255731/s
    checks_succeeded...: 0.00%   0 out of 577
    checks_failed......: 100.00% 577 out of 577

    ✗ deposit status is 200
      ↳  0% — ✓ 0 / ✗ 577

    HTTP
    http_req_duration..............: avg=908.36ms min=17.93ms med=928.7ms max=3.59s   p(90)=1.53s   p(95)=1.68s  
      { expected_response:true }...: avg=61.35ms  min=61.35ms med=61.35ms max=61.35ms p(90)=61.35ms p(95)=61.35ms
    http_req_failed................: 99.82% 577 out of 578
    http_reqs......................: 578    52.346296/s

    EXECUTION
    iteration_duration.............: avg=910.54ms min=20.49ms med=929.8ms max=3.6s    p(90)=1.53s   p(95)=1.68s  
    iterations.....................: 577    52.255731/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 157 kB 14 kB/s
    data_sent......................: 87 kB  7.9 kB/s



running (11.0s), 00/50 VUs, 577 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  10s